{
  "format": "layers-model",
  "generatedBy": "keras v2.9.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": {
    "keras_version": "2.9.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "decoder",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 4],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "decoder_input"
            },
            "name": "decoder_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "decoder_dense",
              "trainable": true,
              "dtype": "float32",
              "units": 65536,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "decoder_dense",
            "inbound_nodes": [[["decoder_input", 0, 0, {}]]]
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [64, 16, 64]
            },
            "name": "reshape",
            "inbound_nodes": [[["decoder_dense", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "decoder_conv_transpose_layer_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "name": "decoder_conv_transpose_layer_1",
            "inbound_nodes": [[["reshape", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "decoder_relu_1",
              "trainable": true,
              "dtype": "float32",
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "decoder_relu_1",
            "inbound_nodes": [[["decoder_conv_transpose_layer_1", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "decoder_bn_1",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "decoder_bn_1",
            "inbound_nodes": [[["decoder_relu_1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "decoder_conv_transpose_layer_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "name": "decoder_conv_transpose_layer_2",
            "inbound_nodes": [[["decoder_bn_1", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "decoder_relu_2",
              "trainable": true,
              "dtype": "float32",
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "decoder_relu_2",
            "inbound_nodes": [[["decoder_conv_transpose_layer_2", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "decoder_bn_2",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "decoder_bn_2",
            "inbound_nodes": [[["decoder_relu_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2DTranspose",
            "config": {
              "name": "decoder_conv_transpose_layer_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 1,
              "kernel_size": [5, 5],
              "strides": [2, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "output_padding": null
            },
            "name": "decoder_conv_transpose_layer_3",
            "inbound_nodes": [[["decoder_bn_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "output_layer",
              "trainable": true,
              "dtype": "float32",
              "activation": "sigmoid"
            },
            "name": "output_layer",
            "inbound_nodes": [[["decoder_conv_transpose_layer_3", 0, 0, {}]]]
          }
        ],
        "input_layers": [["decoder_input", 0, 0]],
        "output_layers": [["output_layer", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "decoder_bn_1/gamma", "shape": [64], "dtype": "float32" },
        { "name": "decoder_bn_1/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "decoder_bn_1/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "decoder_bn_1/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        { "name": "decoder_bn_2/gamma", "shape": [128], "dtype": "float32" },
        { "name": "decoder_bn_2/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "decoder_bn_2/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "decoder_bn_2/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "decoder_conv_transpose_layer_1/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "decoder_conv_transpose_layer_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "decoder_conv_transpose_layer_2/kernel",
          "shape": [3, 3, 128, 64],
          "dtype": "float32"
        },
        {
          "name": "decoder_conv_transpose_layer_2/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "decoder_conv_transpose_layer_3/kernel",
          "shape": [5, 5, 1, 128],
          "dtype": "float32"
        },
        {
          "name": "decoder_conv_transpose_layer_3/bias",
          "shape": [1],
          "dtype": "float32"
        },
        {
          "name": "decoder_dense/kernel",
          "shape": [4, 65536],
          "dtype": "float32"
        },
        { "name": "decoder_dense/bias", "shape": [65536], "dtype": "float32" }
      ]
    }
  ]
}
