{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 64, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "encoder_conv_layer_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_conv_layer_1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "encoder_relu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "encoder_relu_1", "inbound_nodes": [[["encoder_conv_layer_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "encoder_bn_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "encoder_bn_1", "inbound_nodes": [[["encoder_relu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "encoder_conv_layer_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_conv_layer_2", "inbound_nodes": [[["encoder_bn_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "encoder_relu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "encoder_relu_2", "inbound_nodes": [[["encoder_conv_layer_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "encoder_bn_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "encoder_bn_2", "inbound_nodes": [[["encoder_relu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "encoder_conv_layer_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "encoder_conv_layer_3", "inbound_nodes": [[["encoder_bn_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "encoder_relu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "encoder_relu_3", "inbound_nodes": [[["encoder_conv_layer_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "encoder_bn_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "encoder_bn_3", "inbound_nodes": [[["encoder_relu_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["encoder_bn_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_layer_before_bottleneck", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_layer_before_bottleneck", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_before_bottleneck", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_before_bottleneck", "inbound_nodes": [[["dense_layer_before_bottleneck", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "log_variance", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "log_variance", "inbound_nodes": [[["batch_normalization_before_bottleneck", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "mu", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "mu", "inbound_nodes": [[["batch_normalization_before_bottleneck", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["log_variance", 0, 0], ["mu", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "batch_normalization_before_bottleneck/gamma", "shape": [30], "dtype": "float32"}, {"name": "batch_normalization_before_bottleneck/beta", "shape": [30], "dtype": "float32"}, {"name": "batch_normalization_before_bottleneck/moving_mean", "shape": [30], "dtype": "float32"}, {"name": "batch_normalization_before_bottleneck/moving_variance", "shape": [30], "dtype": "float32"}, {"name": "dense_layer_before_bottleneck/kernel", "shape": [65536, 30], "dtype": "float32"}, {"name": "dense_layer_before_bottleneck/bias", "shape": [30], "dtype": "float32"}, {"name": "encoder_bn_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "encoder_bn_1/beta", "shape": [256], "dtype": "float32"}, {"name": "encoder_bn_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "encoder_bn_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "encoder_bn_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "encoder_bn_2/beta", "shape": [128], "dtype": "float32"}, {"name": "encoder_bn_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "encoder_bn_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "encoder_bn_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn_3/beta", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "encoder_conv_layer_1/kernel", "shape": [5, 5, 1, 256], "dtype": "float32"}, {"name": "encoder_conv_layer_1/bias", "shape": [256], "dtype": "float32"}, {"name": "encoder_conv_layer_2/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "encoder_conv_layer_2/bias", "shape": [128], "dtype": "float32"}, {"name": "encoder_conv_layer_3/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "encoder_conv_layer_3/bias", "shape": [64], "dtype": "float32"}, {"name": "log_variance/kernel", "shape": [30, 4], "dtype": "float32"}, {"name": "log_variance/bias", "shape": [4], "dtype": "float32"}, {"name": "mu/kernel", "shape": [30, 4], "dtype": "float32"}, {"name": "mu/bias", "shape": [4], "dtype": "float32"}]}]}